## pandas Series

In [1]:
import pandas as pd
import numpy as np

In [2]:
from numpy.random import randn

In [3]:
np.random.seed(0)

In [4]:
np.random.random(5)

array([0.5488135 , 0.71518937, 0.60276338, 0.54488318, 0.4236548 ])

In [5]:
labels = ['a', 'b', 'c']
my_data = [10, 20, 30]
dic_data = {'a':100, 'b':200, 'c':300}
arr = np.array(my_data)

In [6]:
pd.Series(labels)

0    a
1    b
2    c
dtype: object

In [7]:
pd.Series(my_data)

0    10
1    20
2    30
dtype: int64

In [8]:
pd.Series(dic_data)

a    100
b    200
c    300
dtype: int64

In [9]:
pd.Series(data=my_data, index=labels)

a    10
b    20
c    30
dtype: int64

In [10]:
ser1 = pd.Series([1,2,3,4], ['USA','Japan','China','Swis']) # Series(data, index)
ser1

USA      1
Japan    2
China    3
Swis     4
dtype: int64

In [11]:
ser2 = pd.Series([1,2,4,6], ['USA','Italy','China','BD'])
ser2

USA      1
Italy    2
China    4
BD       6
dtype: int64

In [12]:
ser1 + ser2

BD       NaN
China    7.0
Italy    NaN
Japan    NaN
Swis     NaN
USA      2.0
dtype: float64

## Pandas DataFrame

In [13]:
df = pd.DataFrame(data=randn(5,4), index=['A','B','C','D','E'], columns=['C1','C2','C3','C4'], dtype="float64")
df

         C1        C2        C3        C4
A -0.842724  1.969924  1.266119 -0.505877
B  2.545201  1.080812  0.484312  0.579140
C -0.181583  1.410205 -0.374472  0.275198
D -0.960755  0.376927  0.033439  0.680567
E -1.563497 -0.566698 -0.242150  1.514391

In [14]:
df['C1']

A   -0.842724
B    2.545201
C   -0.181583
D   -0.960755
E   -1.563497
Name: C1, dtype: float64

In [15]:
type(df['C1'])

pandas.core.series.Series

In [16]:
df[['C1','C3']]

         C1        C3
A -0.842724  1.266119
B  2.545201  0.484312
C -0.181583 -0.374472
D -0.960755  0.033439
E -1.563497 -0.242150

In [17]:
df['new'] = df['C2'] + df['C4']
df

         C1        C2        C3        C4       new
A -0.842724  1.969924  1.266119 -0.505877  1.464048
B  2.545201  1.080812  0.484312  0.579140  1.659952
C -0.181583  1.410205 -0.374472  0.275198  1.685403
D -0.960755  0.376927  0.033439  0.680567  1.057494
E -1.563497 -0.566698 -0.242150  1.514391  0.947694

In [18]:
df.drop(labels='new', axis=1)

         C1        C2        C3        C4
A -0.842724  1.969924  1.266119 -0.505877
B  2.545201  1.080812  0.484312  0.579140
C -0.181583  1.410205 -0.374472  0.275198
D -0.960755  0.376927  0.033439  0.680567
E -1.563497 -0.566698 -0.242150  1.514391

In [19]:
df

         C1        C2        C3        C4       new
A -0.842724  1.969924  1.266119 -0.505877  1.464048
B  2.545201  1.080812  0.484312  0.579140  1.659952
C -0.181583  1.410205 -0.374472  0.275198  1.685403
D -0.960755  0.376927  0.033439  0.680567  1.057494
E -1.563497 -0.566698 -0.242150  1.514391  0.947694

In [20]:
df.drop("E")

         C1        C2        C3        C4       new
A -0.842724  1.969924  1.266119 -0.505877  1.464048
B  2.545201  1.080812  0.484312  0.579140  1.659952
C -0.181583  1.410205 -0.374472  0.275198  1.685403
D -0.960755  0.376927  0.033439  0.680567  1.057494

In [21]:
df

         C1        C2        C3        C4       new
A -0.842724  1.969924  1.266119 -0.505877  1.464048
B  2.545201  1.080812  0.484312  0.579140  1.659952
C -0.181583  1.410205 -0.374472  0.275198  1.685403
D -0.960755  0.376927  0.033439  0.680567  1.057494
E -1.563497 -0.566698 -0.242150  1.514391  0.947694

## show only row data

In [22]:
df.loc[['C']]

         C1        C2        C3        C4       new
C -0.181583  1.410205 -0.374472  0.275198  1.685403

In [23]:
df.loc['C']

C1    -0.181583
C2     1.410205
C3    -0.374472
C4     0.275198
new    1.685403
Name: C, dtype: float64

## show index based row

In [24]:
df.iloc[2]

C1    -0.181583
C2     1.410205
C3    -0.374472
C4     0.275198
new    1.685403
Name: C, dtype: float64

In [25]:
df.loc['C','C3']

-0.3744716909802062

In [26]:
df.loc[['B','C'], ['C3','C4']]

         C3        C4
B  0.484312  0.579140
C -0.374472  0.275198

In [27]:
booldf = df>0
booldf

      C1     C2     C3     C4   new
A  False   True   True  False  True
B   True   True   True   True  True
C  False   True  False   True  True
D  False   True   True   True  True
E  False  False  False   True  True

In [28]:
df[booldf]

         C1        C2        C3        C4       new
A       NaN  1.969924  1.266119       NaN  1.464048
B  2.545201  1.080812  0.484312  0.579140  1.659952
C       NaN  1.410205       NaN  0.275198  1.685403
D       NaN  0.376927  0.033439  0.680567  1.057494
E       NaN       NaN       NaN  1.514391  0.947694

In [29]:
df[df>0]

         C1        C2        C3        C4       new
A       NaN  1.969924  1.266119       NaN  1.464048
B  2.545201  1.080812  0.484312  0.579140  1.659952
C       NaN  1.410205       NaN  0.275198  1.685403
D       NaN  0.376927  0.033439  0.680567  1.057494
E       NaN       NaN       NaN  1.514391  0.947694

In [30]:
df['C3']>0

A     True
B     True
C    False
D     True
E    False
Name: C3, dtype: bool

In [31]:
df[df['C3']>0]

         C1        C2        C3        C4       new
A -0.842724  1.969924  1.266119 -0.505877  1.464048
B  2.545201  1.080812  0.484312  0.579140  1.659952
D -0.960755  0.376927  0.033439  0.680567  1.057494

In [32]:
df[df['C3']>0][['C1','C4']]

         C1        C4
A -0.842724 -0.505877
B  2.545201  0.579140
D -0.960755  0.680567

In [33]:
dfseries = df['C3']>0
dfdata = df[dfseries]
dfcolumn = ['C1','C4']
dfdata[dfcolumn]

         C1        C4
A -0.842724 -0.505877
B  2.545201  0.579140
D -0.960755  0.680567

## multiple condition in dataframe

In [34]:
df[(df['C2']>0) & (df['C4']>.5)]

         C1        C2        C3        C4       new
B  2.545201  1.080812  0.484312  0.579140  1.659952
D -0.960755  0.376927  0.033439  0.680567  1.057494

In [35]:
df['states'] = "DD GG HH UU OI".split()

In [36]:
df

         C1        C2        C3        C4       new states
A -0.842724  1.969924  1.266119 -0.505877  1.464048     DD
B  2.545201  1.080812  0.484312  0.579140  1.659952     GG
C -0.181583  1.410205 -0.374472  0.275198  1.685403     HH
D -0.960755  0.376927  0.033439  0.680567  1.057494     UU
E -1.563497 -0.566698 -0.242150  1.514391  0.947694     OI

In [37]:
df.set_index('states')

              C1        C2        C3        C4       new
states
DD     -0.842724  1.969924  1.266119 -0.505877  1.464048
GG      2.545201  1.080812  0.484312  0.579140  1.659952
HH     -0.181583  1.410205 -0.374472  0.275198  1.685403
UU     -0.960755  0.376927  0.033439  0.680567  1.057494
OI     -1.563497 -0.566698 -0.242150  1.514391  0.947694

## multiple index levels

In [38]:
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [39]:
hier_index = pd.MultiIndex.from_tuples(hier_index)
hier_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           codes=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [40]:
df1 = pd.DataFrame(randn(6,2),hier_index,['A','B'])
df1

             A         B
G1 1 -0.333057  0.047365
   2  1.462740  1.535029
   3  0.566440  0.149265
G2 1 -1.078278  1.395472
   2  1.787484 -0.569517
   3  0.175387 -0.462506

In [41]:
df1.loc['G1']

          A         B
1 -0.333057  0.047365
2  1.462740  1.535029
3  0.566440  0.149265

In [42]:
df1.loc['G1'].loc[3]

A    0.566440
B    0.149265
Name: 3, dtype: float64

In [43]:
df1.index.names

FrozenList([None, None])

In [44]:
df1.index.names = ['Groups','Num']
df1

                   A         B
Groups Num
G1     1   -0.333057  0.047365
       2    1.462740  1.535029
       3    0.566440  0.149265
G2     1   -1.078278  1.395472
       2    1.787484 -0.569517
       3    0.175387 -0.462506

In [45]:
df1.loc['G1']

            A         B
Num
1   -0.333057  0.047365
2    1.462740  1.535029
3    0.566440  0.149265

In [46]:
df1.loc['G1'].loc[3]

A    0.566440
B    0.149265
Name: 3, dtype: float64

In [47]:
df1.loc['G1'].loc[3]['B']

0.1492650917123343

In [48]:
df1

                   A         B
Groups Num
G1     1   -0.333057  0.047365
       2    1.462740  1.535029
       3    0.566440  0.149265
G2     1   -1.078278  1.395472
       2    1.787484 -0.569517
       3    0.175387 -0.462506

In [49]:
df1.xs('G1')

            A         B
Num
1   -0.333057  0.047365
2    1.462740  1.535029
3    0.566440  0.149265

In [50]:
df1.xs(key=1,level='Num')

               A         B
Groups
G1     -0.333057  0.047365
G2     -1.078278  1.395472

## pandas missing data

In [51]:
data = {'A':[1,np.nan,np.nan],'B':[4,np.nan,6],'C':[7,8,9]}
data

{'A': [1, nan, nan], 'B': [4, nan, 6], 'C': [7, 8, 9]}

In [52]:
dd = pd.DataFrame(data)
dd

     A    B  C
0  1.0  4.0  7
1  NaN  NaN  8
2  NaN  6.0  9

In [53]:
dd.dropna()

     A    B  C
0  1.0  4.0  7

In [54]:
dd.dropna(axis=1)

   C
0  7
1  8
2  9

In [55]:
dd.dropna(thresh=2)

     A    B  C
0  1.0  4.0  7
2  NaN  6.0  9

In [56]:
dd.fillna(value='FILL')

      A     B  C
0     1     4  7
1  FILL  FILL  8
2  FILL     6  9

In [57]:
dd['B'].fillna(value=dd['B'].mean())

0    4.0
1    5.0
2    6.0
Name: B, dtype: float64

## pandas groupby

In [58]:
datas = {'Company':['G','M','F','G','F','M'],
       'Person':['Sa','Fs','Yt','Gh','Jk','Po'],
       'Sales':[111,222,666,333,444,888]}
datas

{'Company': ['G', 'M', 'F', 'G', 'F', 'M'],
 'Person': ['Sa', 'Fs', 'Yt', 'Gh', 'Jk', 'Po'],
 'Sales': [111, 222, 666, 333, 444, 888]}

In [59]:
dataCompany = pd.DataFrame(datas)
dataCompany

  Company Person  Sales
0       G     Sa    111
1       M     Fs    222
2       F     Yt    666
3       G     Gh    333
4       F     Jk    444
5       M     Po    888

In [60]:
byCompany = dataCompany.groupby('Company')
byCompany

In [61]:
byCompany.sum()

         Sales
Company
F         1110
G          444
M         1110

In [62]:
byCompany.mean()

         Sales
Company
F          555
G          222
M          555

In [63]:
byCompany.std()

              Sales
Company
F        156.977705
G        156.977705
M        470.933116

In [64]:
byCompany.sum().loc['F']

Sales    1110
Name: F, dtype: int64

In [65]:
dataCompany.groupby('Company').min()

        Person  Sales
Company
F           Jk    444
G           Gh    111
M           Fs    222

In [66]:
dataCompany.groupby('Company').describe()

        Sales
        count   mean         std    min    25%    50%    75%    max
Company
F         2.0  555.0  156.977705  444.0  499.5  555.0  610.5  666.0
G         2.0  222.0  156.977705  111.0  166.5  222.0  277.5  333.0
M         2.0  555.0  470.933116  222.0  388.5  555.0  721.5  888.0

In [67]:
dataCompany.groupby('Company').describe().transpose()

Company               F           G           M
Sales count    2.000000    2.000000    2.000000
      mean   555.000000  222.000000  555.000000
      std    156.977705  156.977705  470.933116
      min    444.000000  111.000000  222.000000
      25%    499.500000  166.500000  388.500000
      50%    555.000000  222.000000  555.000000
      75%    610.500000  277.500000  721.500000
      max    666.000000  333.000000  888.000000

## dataframe concatenation

In [68]:
df_1 = pd.DataFrame({'A':['A10','A11','A12','A13'],
                    'B':['B10','B11','B12','B13'],
                    'C':['C10','C11','C12','C13'],
                    'D':['D10','D11','D12','D13']},
                   index=[0,1,2,3])
df_1

     A    B    C    D
0  A10  B10  C10  D10
1  A11  B11  C11  D11
2  A12  B12  C12  D12
3  A13  B13  C13  D13

In [69]:
df_2 = pd.DataFrame({'A':['A20','A21','A22','A23'],
                    'B':['B20','B21','B22','B23'],
                    'C':['C20','C21','C22','C23'],
                    'D':['D20','D21','D22','D23']},
                   index=[4,5,6,7])
df_2

     A    B    C    D
4  A20  B20  C20  D20
5  A21  B21  C21  D21
6  A22  B22  C22  D22
7  A23  B23  C23  D23

In [70]:
df_3 = pd.DataFrame({'A':['A30','A31','A32','A33'],
                    'B':['B30','B31','B32','B33'],
                    'C':['C30','C31','C32','C33'],
                    'D':['D30','D31','D32','D33']},
                   index=[8,9,10,11])
df_3

      A    B    C    D
8   A30  B30  C30  D30
9   A31  B31  C31  D31
10  A32  B32  C32  D32
11  A33  B33  C33  D33

In [71]:
pd.concat([df_1,df_2,df_3])

      A    B    C    D
0   A10  B10  C10  D10
1   A11  B11  C11  D11
2   A12  B12  C12  D12
3   A13  B13  C13  D13
4   A20  B20  C20  D20
5   A21  B21  C21  D21
6   A22  B22  C22  D22
7   A23  B23  C23  D23
8   A30  B30  C30  D30
9   A31  B31  C31  D31
10  A32  B32  C32  D32
11  A33  B33  C33  D33

In [72]:
c_data = pd.concat([df_1,df_2,df_3], axis=1)
c_data.fillna(value='x')

      A    B    C    D    A    B    C    D    A    B    C    D
0   A10  B10  C10  D10    x    x    x    x    x    x    x    x
1   A11  B11  C11  D11    x    x    x    x    x    x    x    x
2   A12  B12  C12  D12    x    x    x    x    x    x    x    x
3   A13  B13  C13  D13    x    x    x    x    x    x    x    x
4     x    x    x    x  A20  B20  C20  D20    x    x    x    x
5     x    x    x    x  A21  B21  C21  D21    x    x    x    x
6     x    x    x    x  A22  B22  C22  D22    x    x    x    x
7     x    x    x    x  A23  B23  C23  D23    x    x    x    x
8     x    x    x    x    x    x    x    x  A30  B30  C30  D30
9     x    x    x    x    x    x    x    x  A31  B31  C31  D31
10    x    x    x    x    x    x    x    x  A32  B32  C32  D32
11    x    x    x    x    x    x    x    x  A33  B33  C33  D33

## merging dataframe

In [73]:
df_left = pd.DataFrame({'A':['A10','A11','A12','A13'],
                    'B':['B10','B11','B12','B13'],
                    'C':['C10','C11','C12','C13'],
                    'key':['key10','key11','key12','key13']})
df_right = pd.DataFrame({'AA':['A20','A21','A22','A23'],
                    'BB':['B20','B21','B22','B23'],
                    'CC':['C20','C21','C22','C23'],
                    'key':['key10','key11','key12','key13']})

In [74]:
pd.merge(df_left,df_right,how='inner',on='key')

     A    B    C    key   AA   BB   CC
0  A10  B10  C10  key10  A20  B20  C20
1  A11  B11  C11  key11  A21  B21  C21
2  A12  B12  C12  key12  A22  B22  C22
3  A13  B13  C13  key13  A23  B23  C23

In [75]:
df_left = pd.DataFrame({'A':['A10','A11','A12','A13'],
                    'B':['B10','B11','B12','B13'],
                    'C':['C10','C11','C12','C13'],
                    'key1':['key10','key11','key12','key13'],
                    'key2':['key10','key11','key10','key10']})
df_right = pd.DataFrame({'AA':['A20','A21','A22','A23'],
                    'BB':['B20','B21','B22','B23'],
                    'CC':['C20','C21','C22','C23'],
                    'key1':['key10','key11','key11','key13'],
                    'key2':['key10','key10','key11','key11']})

In [76]:
pd.merge(df_left,df_right,on=['key1','key2'])

     A    B    C   key1   key2   AA   BB   CC
0  A10  B10  C10  key10  key10  A20  B20  C20
1  A11  B11  C11  key11  key11  A22  B22  C22

In [77]:
pd.merge(df_left,df_right,how='outer',on=['key1','key2'])

     A    B    C   key1   key2   AA   BB   CC
0  A10  B10  C10  key10  key10  A20  B20  C20
1  A11  B11  C11  key11  key11  A22  B22  C22
2  A12  B12  C12  key12  key10  NaN  NaN  NaN
3  A13  B13  C13  key13  key10  NaN  NaN  NaN
4  NaN  NaN  NaN  key11  key10  A21  B21  C21
5  NaN  NaN  NaN  key13  key11  A23  B23  C23

In [78]:
pd.merge(df_left,df_right,how='left',on=['key1','key2'])

     A    B    C   key1   key2   AA   BB   CC
0  A10  B10  C10  key10  key10  A20  B20  C20
1  A11  B11  C11  key11  key11  A22  B22  C22
2  A12  B12  C12  key12  key10  NaN  NaN  NaN
3  A13  B13  C13  key13  key10  NaN  NaN  NaN

In [79]:
pd.merge(df_left,df_right,how='right',on=['key1','key2'])

     A    B    C   key1   key2   AA   BB   CC
0  A10  B10  C10  key10  key10  A20  B20  C20
1  A11  B11  C11  key11  key11  A22  B22  C22
2  NaN  NaN  NaN  key11  key10  A21  B21  C21
3  NaN  NaN  NaN  key13  key11  A23  B23  C23

## join dataframe

In [80]:
df_left = pd.DataFrame({'A':['A10','A11','A12','A13'],
                    'B':['B10','B11','B12','B13'],
                    'C':['C10','C11','C12','C13']},
                    index=['key10','key11','key12','key12'])
df_right = pd.DataFrame({'AA':['A20','A21','A22','A23'],
                    'BB':['B20','B21','B22','B25'],
                    'CC':['C20','C21','C22','C24']},
                    index=['key10','key11','key10','key11'])

In [81]:
df_left.join(df_right)

         A    B    C   AA   BB   CC
key10  A10  B10  C10  A20  B20  C20
key10  A10  B10  C10  A22  B22  C22
key11  A11  B11  C11  A21  B21  C21
key11  A11  B11  C11  A23  B25  C24
key12  A12  B12  C12  NaN  NaN  NaN
key12  A13  B13  C13  NaN  NaN  NaN

In [82]:
df_left.join(df_right, how='inner')

         A    B    C   AA   BB   CC
key10  A10  B10  C10  A20  B20  C20
key10  A10  B10  C10  A22  B22  C22
key11  A11  B11  C11  A21  B21  C21
key11  A11  B11  C11  A23  B25  C24